; Removed "once per turn" from descriptions and improved wording
[ReturnFire X2AbilityTemplate]
LocHelpText="When targeted by an enemy attack, automatically fire back with your <Ability:SecondaryWeaponName/>."
LocLongDescription="When targeted by an enemy attack, automatically fire back with your <Ability:SecondaryWeaponName/>."
LocPromotionPopupText="<Bullet/> Return Fire can be triggered by melee attacks and Area of Effect attacks.<br/><Bullet/> Return Fire will not trigger when targeted by Overwatch fire.<br/>"

[SkirmisherReturnFire X2AbilityTemplate]
LocHelpText="When targeted by an enemy attack, automatically fire back with your <Ability:WeaponName/>."
LocLongDescription="When targeted by an enemy attack, automatically fire back with your <Ability:WeaponName/>."
LocPromotionPopupText="<Bullet/> Return Fire can be triggered by melee attacks and Area of Effect attacks.<br/><Bullet/> Return Fire will not trigger when targeted by Overwatch fire.<br/>"
